src/test/resources/request/parser_ok.xml

<soapenv:Envelope
        xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xs="http://www.w3.org/2001/XMLSchema"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <paf:level1obj>
            <level2obj>
                <level3obj>
                    <level4field>field4</level4field>
                </level3obj>
                <level3field>field3</level3field>
            </level2obj>
            <level2field>field2</level2field>
        </paf:level1obj>
        <paf:level1field>field1</paf:level1field>
        <paf:level1list>
            <level2element>field2list1</level2element>
            <level2element>field2list2</level2element>
            <level2element>field2list3</level2element>
        </paf:level1list>
        <paf:level1objlist>
            <level2obj>
                <level3field1>field1obj1</level3field1>
                <level3field2>field2obj1</level3field2>
            </level2obj>
            <level2obj>
                <level3field1>field1obj2</level3field1>
                <level3field2>field2obj2</level3field2>
            </level2obj>
        </paf:level1objlist>
    </soapenv:Body>
</soapenv:Envelope>